---
kind: method
id: M:Autodesk.Revit.DB.DocumentPreviewSettings.Dispose
source: html/775ea199-ae74-23a6-883b-31c3c20742e0.htm
---
# Autodesk.Revit.DB.DocumentPreviewSettings.Dispose Method

Releases all resources used by the DocumentPreviewSettings

## Syntax (C#)
```csharp
public void Dispose()
```